In [1]:
import pandas as pd

In [4]:
df1=pd.DataFrame({'Id':[1,2,3], 'roll':[5,6,7]})
df1

   Id  roll
0   1     5
1   2     6
2   3     7

In [5]:
df2=pd.DataFrame({'name':[1,2,3], 'class':[5,6,7]})
df2

   name  class
0     1      5
1     2      6
2     3      7

In [7]:
df1.join(df2)

   Id  roll  name  class
0   1     5     1      5
1   2     6     2      6
2   3     7     3      7

In [16]:
df1.join(df2,how='right',lsuffix=False)

   Id  roll  name  class
0   1     5     1      5
1   2     6     2      6
2   3     7     3      7

In [18]:
df2=pd.DataFrame({'name':[1,2,3], 'class':[5,6,7]})
df2
df3=pd.DataFrame({'name':[1,3], 'class':[6,7]})
df3
display(df2,df3)

   name  class
0     1      5
1     2      6
2     3      7

   name  class
0     1      6
1     3      7

In [20]:
df1=pd.DataFrame({'Id':[1,2,3], 'roll':[5,6,7]},index=['a','b','c'])
df1

   Id  roll
a   1     5
b   2     6
c   3     7

In [21]:
df2=pd.DataFrame({'name':[1,2,3], 'class':[5,6,7]})
df2

   name  class
0     1      5
1     2      6
2     3      7

In [22]:
df1.join(df2)

   Id  roll  name  class
a   1     5   NaN    NaN
b   2     6   NaN    NaN
c   3     7   NaN    NaN

In [23]:
df1

   Id  roll
a   1     5
b   2     6
c   3     7

In [24]:
df2

   name  class
0     1      5
1     2      6
2     3      7

In [25]:
df1=pd.DataFrame({'Id':[1,2,3], 'roll':[5,6,7]},index=['a','b','c'])
df1

   Id  roll
a   1     5
b   2     6
c   3     7